source/_posts/2014-03-09-capybara-phantomjs-poltergeist-rspec-tips.html
---
layout: post
title: "Capybara PhantomJs Poltergeist Rspec Tips"
date: 2014-03-09 18:50:19 -1000
comments: true
categories: 
keywords: 
description: 
---

<p>
I've added a page of <a href="http://www.railsonmaui.com/tips/rails/capybara-phantomjs-poltergeist-rspec-rails-tips.html">tips on integration (aka feature spec) testing using Capybara, PhantomJs,
Poltergeist, and Rspec</a>.
</p>

<p>
Some of the tips include:
</p>
<ol class="org-ol">
<li>Favorite test configuration (gems, spec_helper, etc.) for feature specs.
</li>
<li>How to troubleshoot and debug feature specs
</li>
<li>My setup for using Zeus with parallel-tests, including a rake task for
setting up the databases.
</li>
<li>Tricky testing:
a. Auto-complete dropdowns (some handy utility methods).
b. Hover effects (easy now!)
c. AJAX
</li>
</ol>

<p>
I'll try to keep this page of tips updated as my test configuration evolves.
</p>
